{"Trump loyalist Kash Patel is confirmed as FBI director by the Senate despite deep Democratic doubts_4781169678457800559": {"timestamp": 1740080384.475793, "sentiment": {"pos": 0.14389999999999997, "neu": 0.7301, "neg": 0.126}, "text": ["State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code", "“I cannot imagine a worse choice,” Sen. Dick Durbin, D-Ill., told colleagues before the 51-49 vote by the GOP-controlled Senate.\nPatel raised alarm among Democrats for saying before he was nominated that he would “come after” anti-Trump “conspirators” in the federal government and the media.\nPatel wants to make the FBI accountable once again -– get back the reputation that the FBI has had historically for law enforcement,” Sen. Chuck Grassley, R-Iowa, chairman of the Senate Judiciary Committee, said before Patel was confirmed.\n“This is someone who lacks the character to do this job, someone who lacks the integrity to do this job.\nPatel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defense secretary.", "Senator Jerry Moran met with Patel on Jan. 17-courtesy photo“I cannot imagine a worse choice,\" Sen. Dick Durbin, D-Ill., told colleagues before the 51-49 vote by the GOP-controlled Senate.\nSenator Jerry Moran during the vote count Thursday afternoon-image courtesy CSPANSenators Susan Collins of Maine and Lisa Murkowski of Alaska were the lone Republican holdouts.\nPatel wants to make the FBI accountable once again -– get back the reputation that the FBI has had historically for law enforcement,” Sen. Chuck Grassley, R-Iowa, chairman of the Senate Judiciary Committee, said before Patel was confirmed.\n“I am absolutely sure of this one thing: this vote will haunt anyone who votes for him.\nPatel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defense secretary.", "ToplineThe Senate confirmed Kash Patel as FBI director Thursday, despite Sens.\nFBI Director Christopher Wray announced his intention to resign, clearing the way for Trump to install Patel as the next FBI chief.\nTrump announced he’s nominating Patel to be the next FBI director, following reports that Patel was being floated for the position.\nWho Is Kash Patel?\nKey BackgroundTrump named Patel as his FBI nominee in November, even before current FBI Director Christopher Wray announced in December he intended to resign.", "But while both Gabbard and Kennedy are relatively recent allies of Trump, Patel was scrutinised for his longstanding allegiance to the Republican leader and real estate tycoon.\n“ I do not agree with commutation of any sentence of any individual who committed violence against law enforcement,” Patel responded.\nThere will be no politicisation of the FBI,” Patel said in an interaction with Senator Chris Coons.\n“Senator, I will always obey the law,” Patel replied, appearing to sidestep the question.\nExpanding law enforcement capabilitiesPatel, meanwhile, sought to play up one of his selling points: that he would flesh out the FBI’s law enforcement capabilities.", "Kash Patel, facing questions about his independence, says FBI reform is his focustoggle caption Anna Moneymaker/Getty ImagesWe're following the confirmation hearings for the incoming Trump administration.\nSponsor Message\"Our national security is at threat both internally and externally,\" he told the committee.\nHe has held senior national security jobs, sold self-branded merchandise online and written a children's book called The Plot Against the King, featuring a wizard named Kash and a king named Donald.\nIt also helped him land a job on Trump's National Security Council and later as a top aide to the director of national intelligence and to the secretary of defense.\nWhen asked if he would let Musk have input on personnel, Patel repeated the FBI would be independent.", "Midland Memorial Hospital’s Critical Care and Progressive Care Units were both just awarded the Beacon Award for Excellence from the American Association of Critical-Care Nurses (AACN).\nThe AACN, based out of Aliso Viejo, California, recognized Midland Memorial Hospital’s Critical Care Unit with a silver-level Beacon Award for Excellence and Midland Memorial Hospital’s Progressive Care Unit with a bronze-level Beacon Award for Excellence, making them the only designated units in the Permian Basin, a news release said.\nThe Beacon Award for Excellence recognizes unit caregivers who improve outcomes and align practices with AACN’s six Healthy Work Environment Standards.\n“The Beacon Award for Excellence recognizes caregivers in outstanding units whose consistent and systematic approach to evidence-based care optimizes patient outcomes.\n“They continue to show their dedication to providing quality patient care to our community.”To learn more, visit www.aacn.org/beaconLike this: Like Loading...Related", "MADRID (AP) — Former Spanish soccer boss Luis Rubiales was found guilty of sexually assaulting player Jenni Hermoso on Thursday for kissing her after the 2023 Women’s World Cup final.\nMADRID (AP) — Former Spanish soccer boss Luis Rubiales was found guilty of sexually assaulting player Jenni Hermoso on Thursday for kissing her after the 2023 Women’s World Cup final.\nThe kiss sparked outrage in Spain and marred the celebrations of Spain’s first Women's World Cup title.\nHermoso testified that she “felt disrespected” by Rubiales after winning the World Cup.\nThe kiss prompted widespread outrage in society beyond soccer, and ignited one of the most embarrassing scandals in the history of Spanish soccer.", "President-elect Donald Trump’s stunning announcement that he will nominate Kash Patel as FBI director sets the stage for a fresh round of turbulence at a law enforcement agency tasked with protecting the homeland and investigating federal crimes.\nWhat happens to the current FBI director?\nWray was appointed director by Trump in 2017 and technically has three years left on his 10-year tenure.\nTrump last week said he intended to nominate former Florida attorney general Pam Bondi to serve as attorney general.\nPatel has talked about disentangling the FBI’s intelligence-gathering operations — now a core function of the bureau’s mandate — from the rest of its operations.", "It is already clear that confirming Patel through the US Senate is likely to be less than plain sailing.\nMike Rounds, a Republican senator from South Dakota, indicated that Patel could face a tough confirmation battle.\nThe senator also emphasised the separation of powers between president and Senate, signaling possible trouble for Patel.\nHe has long denigrated the FBI as a pillar of what he calls the “deep state” or the “corrupt ruling class”.\nBut he did highlight that Biden had kept Wray on as FBI chief, despite having inherited the official from Trump."]}, "The latest on Trump’s presidency as Musk threatens more cuts to federal_-6800685519672302086": {"timestamp": 1740366935.4519548, "sentiment": {"pos": 0.12799999999999997, "neu": 0.7562, "neg": 0.11579999999999999}, "text": ["“Consistent with President @realDonaldTrump’s instructions, all federal employees will shortly receive an email requesting to understand what they got done last week,” Musk posted on X, which he owns.\n“Failure to respond will be taken as a resignation.”Shortly afterward, federal employees — including some judges, court staff and federal prison officials — received a three-line email with this instruction: “Please reply to this email with approx.\nSome agencies soon told employees that they did not have to comply if they received Musk’s message.\n“AFGE will challenge any unlawful terminations of our members and federal employees across the country.”Musk on Friday celebrated his new role at a gathering of conservatives by waving a giant chainsaw in the air.\nIn a message to employees on Saturday night, federal court officials instructed recipients not to respond.", "By late last week, President Trump had decided to fire Gen. Charles Q.\nMr. Trump and General Caine met for an hour at the White House on Feb. 14.\nThe president’s deep skepticism prompted him to pass over the more obvious choices, like General Kurilla, to replace General Brown and to pluck General Caine from relative obscurity.\nHe was meeting regularly with Mr. Trump and other top national security aides to discuss military priorities in the Middle East.\nIn the end, General Kurilla seemed too similar to the officers whom Mr. Trump had soured on, aides said.", "WASHINGTON (AP) — Key U.S. agencies, including the FBI, State Department and the Pentagon, have instructed their employees not to comply with cost-cutting chief Elon Musk’s latest demand that federal workers explain what they accomplished last week — or risk losing their job.\nAnd by Sunday evening, agency leadership issued new instructions that employees should “pause activities” on the request until noon Monday.\n“If I could say one thing to Elon Musk, it’s like, please put a dose of compassion in this,” Curtis, whose state has 33,000 federal employees, said on CBS’ “Face the Nation.” “These are real people.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email.", "President Donald Trump's chainsaw-wielding, cost-cutting partner Elon Musk threatened federal employees with termination on Saturday, if they did not respond to an email from the Office of Personnel Management highlighting their work last week.\nThe email asked workers to reply and provide \"approx.\n5 bullets of what you accomplished last week and cc your manager\" before Monday at 11:59 p.m.\nEverett Kelley, national president of the American Federation of Government Employees, the top union representing federal workers, has already said the organization would challenge any “unlawful terminations” that result from not responding.\nThe AFGE represents more than 800,000 federal workers.", "They played a crucial role in helping Black workers like Verdine join the middle class and thrive.\nBut vast cuts by the Trump administration, led by Elon Musk’s Department of Government Efficiency, are threatening to close down that once-dependable path to financial stability.\n“The federal workforce was a means to help build Black middle class.\nSo, the idea that DEI was some pathway to giving Black people jobs, that just wasn’t true,” she said.\nSmith, from Local 252, said that although the federal jobs cuts are not labeled as DEI casualties, the pattern is curious.", "Elon Musk, the billionaire head of the Trump administration's Department of Government Efficiency, threatened on Saturday to fire any federal worker who fails to explain what work they have accomplished during the previous week.\n\"All federal employees will shortly receive an email requesting to understand what they got done last week,\" Musk posted on X, formerly Twitter.\nWATCH | Protests on Capitol Hill target Musk cuts: DOGE claims to have saved $55B by slashing U.S. federal workforce Duration 2:50 The U.S. federal government purge led by Elon Musk and his Department of Government Efficiency (DOGE) has allegedly saved $55 billion largely through cutting jobs and contracts.\nSome government workers have resigned in protest over the restructuring moves and Musk’s access to sensitive data.\nIt is unclear what legal basis Musk has to terminate federal workers if they fail to respond to his request, which comes amid the Trump administration's fast-paced and controversial process to reduce government spending by shrinking the federal workforce.", "Photograph: Justin Lane/EPADemocratic critics and legal experts see Trump’s IG firings and Musk’s Doge operation as blatant examples of executive power plays at the expense of Congress and transparency.\nIn response, Musk and Trump lashed out by charging judicial interference.\nView image in fullscreen Elon Musk stands behind Donald Trump at the Oval Office on Tuesday.\nThe lawsuit argues that Trump violated the constitution’s appointments clause by establishing a federal agency without Congress’s approval.\nAt bottom, some legal experts and watchdogs say the threats posed by Musk’s cost-cutting drive that Trump has blessed, are linked to the record sums that Musk gave Trump’s campaign.", "Is there any sort of precedent for the power Trump is delegating to Musk?\nI don't think that comparison is entirely accurate, but it does illustrate the degree to which Trump has given Musk a pretty unprecedented level of access and power.\nI would guess that it matters to the extent that Trump thinks Musk is helping or hurting him.\njulia_azari: I've been in the camp of predicting a pretty significant clash between Musk and Trump in the future.\nI think public pushback, both broadly and in concentrated efforts, does affect these things, at least at the margin.", "Elon Musk deepened the confusion and alarm of workers across the federal government Saturday by ordering them to summarize their accomplishments for the week, warning that a failure to do so would be taken as a resignation.\nShortly after Mr. Musk’s demand, which he posted on X, civil servants across the government received an email from the Office of Personnel Management with the subject line, “What did you do last week?”The missive simultaneously hit inboxes across multiple agencies, rattling workers who had been rocked by layoffs in recent weeks and were unsure about whether to respond to Mr. Musk’s demand.\nOfficials at some agencies, including the F.B.I.\nand the State Department, told their employees to pause responses to the email.\nMr. Musk’s mounting pressure on the federal work force came at the encouragement of President Trump, who has been trumpeting how the billionaire has upended the bureaucracy and on Saturday urged him to be even “more aggressive.”", "Trump threatens to cut funding for South Africa over land policyThere have been continuous calls for the government to address land reform and deal with the past injustices of racial segregation.\nHe added that the only funding South Africa received from the US was through the health initiative Pepfar, which represented \"17% of South Africa's HIV/Aids programme\".\nThe US allocated about $440m (£358m) in assistance to South Africa in 2023, according to US government data.\nThe ANC, led by Ramaphosa, currently governs South Africa as part of a coalition government with nine smaller parties.\nAt that time, South Africa accused Trump of seeking to sow division, with a spokesperson saying he was \"misinformed\"."]}, "Trump loyalist Kash Patel is confirmed as FBI director by the Senate despite deep Democratic doubts_6537883626803015481": {"timestamp": 1740518747.077445, "sentiment": {"pos": 0.15099999999999997, "neu": 0.789625, "neg": 0.059375}, "text": ["“I cannot imagine a worse choice,” Sen. Dick Durbin, D-Ill., told colleagues before the 51-49 vote by the GOP-controlled Senate.\nPatel wants to make the FBI accountable once again -– get back the reputation that the FBI has had historically for law enforcement,” Sen. Chuck Grassley, R-Iowa, chairman of the Senate Judiciary Committee, said this week before Patel was confirmed.\n“This is someone who lacks the character to do this job, someone who lacks the integrity to do this job.\nAt his Senate hearing in January, Patel said Democrats were taking some of his comments out of context or misunderstanding the broader point he was trying to make.\nPatel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defense secretary.", "Senate confirms Kash Patel, fierce critic of FBI, to head the bureautoggle caption Anna Moneymaker/Getty ImagesThe Republican-led Senate voted Thursday to confirm Kash Patel as the new FBI director despite questions about whether he has the qualifications and the temperament to lead the nation's most powerful law enforcement agency.\nPatel, a close ally of President Trump and a fierce critic of the FBI, was confirmed by a 51-49 vote, with Republican Sens.\nConcerns about Patel's ability to lead the FBI were reflected in the narrow margin of his confirmation vote.\nDemocrats warn of \"red flags\"On Thursday morning, Democrats on the Senate Judiciary Committee gathered in front of FBI headquarters to speak out against Patel.\nSponsor MessageAfter Trump's election win last November, he tapped Patel to lead the FBI, effectively pushing Wray out of the job.", "The person who discussed Patel’s vision did so on condition of anonymity to describe plans that have not been made public.\nAt his swearing-in ceremony, Patel called the opportunity to lead the nation’s premier federal law enforcement agency the “greatest honor” of his life.\nPatel has repeatedly spoken of his desire to implement major changes at the FBI.\n“Anyone that wishes to do harm to our way of life and our citizens, here and abroad, will face the full wrath of the DOJ and FBI,\" Patel said.\nCredit: AP Credit: APCredit: AP Credit: AP", "Mr. Schiff described Mr. Patel as a “political hack” and a “sycophant” who is unqualified for the position.\nHe went on to add that Mr. Patel is absolutely unqualified for the job and the Republicians are also aware about the same.\n“Adam Schiff is the worst criminal in Congress in the last 250 years,” he said.\nBillionaire Elon Musk echoed this, saying, “Adam Schiff is a criminal.”Who is Adam Schiff?\nMr. Schiff subsequently relocated to Los Angeles to take on the role of law clerk for Judge William Matthew Byrne, Jr.", "Goshen, IN (46526)TodayPartly cloudy skies this evening will become overcast overnight.\nSlight chance of a rain shower.\nN winds shifting to SE at 10 to 20 mph..TonightPartly cloudy skies this evening will become overcast overnight.\nSlight chance of a rain shower.\nN winds shifting to SE at 10 to 20 mph.", "NEW YORK: Newly-confirmed FBI Director Kash Patel got a Bollywood-style welcome from an aide of US President Donald Trump, who shared a morphed video of him dancing to the song -- Malhari -- from the film 'Bajirao Mastani'.\nPatel, 44, was confirmed on Thursday by a narrow vote in the Republican-led Senate, 51 to 49, and becomes the first Indian-American to lead the country's premier law enforcement agency.\nFollowing his confirmation, former White House Deputy Chief of Staff Dan Scavino posted on X an edited video of the song Malhari from the Ranveer Singh-starrer movie.\nIn the video, Patel's face is superimposed on Singh's, who is seen performing a victory dance.", "This website uses cookies to collect information about your visit for purposes such as showing you personalized ads and content, and analyzing our website traffic.\nBy clicking “Accept all,” you will allow the use of these cookies.\nAccept allReject all", "The US senate has narrowly voted to confirm Kash Patel as director of the FBI.\nHe resigned before Mr Trump took office.\nMr Trump has said that he expects some of those agents will be fired.\nHe attracted Mr Trump’s attention during the president’s first term when, as a staffer on the Republican-led House Intelligence Committee, Mr Patel helped write a memo with pointed criticism of the FBI’s investigation into ties between Russia and Mr Trump’s 2016 campaign.\nMr Patel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defence secretary."]}, "The latest on Trump’s presidency as Musk threatens more cuts to federal_-6385002475793101748": {"timestamp": 1740518881.53686, "sentiment": {"pos": 0.07529999999999998, "neu": 0.7324999999999999, "neg": 0.19219999999999998}, "text": ["WASHINGTON (AP) — Key U.S. agencies, including the FBI, State Department and the Pentagon, have instructed their employees not to comply with cost-cutting chief Elon Musk’s latest demand that federal workers explain what they accomplished last week — or risk losing their job.\nAnd by Sunday evening, agency leadership issued new instructions that employees should “pause activities” on the request until noon Monday.\n“If I could say one thing to Elon Musk, it’s like, please put a dose of compassion in this,” Curtis, whose state has 33,000 federal employees, said on CBS’ “Face the Nation.” “These are real people.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email.", "WASHINGTON (AP) — President Donald Trump voiced support for Elon Musk’s demand that federal employees explain their recent accomplishments by the end of Monday or risk getting fired, an edict that has spawned new litigation and added to turmoil within the government workforce.\n“What he’s doing is saying, ‘Are you actually working?’” Trump said in the Oval Office during a meeting with French President Emmanuel Macron.\nThe guidance led to a proliferation of varying advice for federal employees, depending on where they work.\nThey’ve urged employees to resign, directed agencies to lay off probationary workers and halted work at some agencies altogether.\n“The email is legitimate and employees should respond,” wrote Rachel Oglesby, chief of staff at the department.", "I do five things in about ten minutes, and all federal workers should be working at the same pace that President Trump is working.\nThe White House announcement this morning did not say what topics will be covered or how many will be signed.\nShare Updated at 16.22 EST1h ago 15.28 EST Judge gives Trump administration Wednesday night deadline to pay foreign aid funds This report is from Reuters.\nRead more Share Updated at 15.53 EST1h ago 15.22 EST Judge extends block on Trump administration's freeze on federal funding This report is from Reuters.\nA federal judge in Seattle has blocked Donald Trump’s effort to halt the nation’s refugee admissions system.", "White House says Elon Musk will attend the first cabinet meetingYour support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.\nAnd unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls.\nRead moreDonald Trump’s administration remains mired in chaos after Elon Musk issued a new ultimatum on Monday night.\nHe gave federal workers one more chance to reply to his email threatening their jobs after multiple agency heads told their staff to ignore him.\nMusk apparently left himself a path to back off from his latest ultimatum by saying it was “subject to the discretion of the President,” adding to the chaos and confusion for workers.", "And by Sunday evening, agency leadership issued new instructions that employees should “pause activities” related to the request until noon on Monday.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email.\nPentagon leadership instructed employees to “pause” any response to Musk’s team, according to an email from Jules Hurst, the deputy undersecretary of defense for personnel and readiness.\nThe Homeland Security Department, meanwhile, told employees that “no reporting action from you is needed at this time” and that agency managers would respond, according to an email from R.D.", "Elon Musk deepened the confusion and alarm of workers across the federal government Saturday by ordering them to summarize their accomplishments for the week, warning that a failure to do so would be taken as a resignation.\nShortly after Mr. Musk’s demand, which he posted on X, civil servants across the government received an email from the Office of Personnel Management with the subject line, “What did you do last week?”The missive simultaneously hit inboxes across multiple agencies, rattling workers who had been rocked by layoffs in recent weeks and were unsure about whether to respond to Mr. Musk’s demand.\nOfficials at some agencies, including the F.B.I.\nand the State Department, told their employees to pause responses to the email.\nMr. Musk’s mounting pressure on the federal work force came at the encouragement of President Trump, who has been trumpeting how the billionaire has upended the bureaucracy and on Saturday urged him to be even “more aggressive.”", "WASHINGTON (AP) — President Donald Trump voiced support for Elon Musk’s demand that federal employees explain their recent accomplishments by the end of Monday or risk getting fired, an edict that has spawned new litigation and added to turmoil within the government workforce.\n“What he’s doing is saying, ‘Are you actually working?’” Trump said in the Oval Office during a meeting with French President Emmanuel Macron.\n“If people don’t respond, it’s very possible that there is no such person, or they aren’t working,” Trump said.\nREAD MORE: Fired federal workers search for new jobs but struggle to replace their old onesThe lawsuit, spearheaded by the State Democracy Defenders Fund, called the threat of mass firings “one of the most massive employment frauds in the history of this country.”The White House criticized the litigation.\n“The email is legitimate and employees should respond,” wrote Rachel Oglesby, chief of staff at the department.", "President Donald Trump's chainsaw-wielding, cost-cutting partner Elon Musk threatened federal employees with termination on Saturday, if they did not respond to an email from the Office of Personnel Management highlighting their work last week.\nThe email asked workers to reply and provide \"approx.\n5 bullets of what you accomplished last week and cc your manager\" before Monday at 11:59 p.m.\nEverett Kelley, national president of the American Federation of Government Employees, the top union representing federal workers, has already said the organization would challenge any “unlawful terminations” that result from not responding.\nThe AFGE represents more than 800,000 federal workers.", "White House says Elon Musk will attend the first cabinet meetingYour support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.\nAnd unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls.\nRead moreDonald Trump’s administration remains mired in chaos after Elon Musk issued a new ultimatum on Monday night.\nHe gave federal workers one more chance to reply to his email threatening their jobs after multiple agency heads told their staff to ignore him.\nMusk apparently left himself a path to back off from his latest ultimatum by saying it was “subject to the discretion of the President,” adding to the chaos and confusion for workers.", "McFadden, discussing the composition of the “press pool” that is chosen by the White House Correspondents’ Association, questioned why the government was obligated to follow those choices.\n“It feels a little odd that the White House is somehow bound by the decisions this private organization is making,” the judge told AP attorneys.\n(AP Photo/Kevin Wolf) Share Share Copy Link copiedEmailFacebookXRedditLinkedInPinterestFlipboardPrint Read MoreHe also questioned AP’s noting of its longtime membership in the White House press pool.\nBut he noted that the correspondents’ group had been tasked by the White House to choose the members of its pool.\n“The White House has accepted the correspondents’ association to be the referee here, and has just discriminated against one organization."]}, "The latest on Trump’s presidency as Musk threatens more cuts to federal_-2089654806553314053": {"timestamp": 1740525023.1967192, "sentiment": {"pos": 0.09578084383123375, "neu": 0.7469506098780244, "neg": 0.15726854629074183}, "text": ["WASHINGTON (AP) — Key U.S. agencies, including the FBI, State Department and the Pentagon, have instructed their employees not to comply with cost-cutting chief Elon Musk’s latest demand that federal workers explain what they accomplished last week — or risk losing their job.\nAnd by Sunday evening, agency leadership issued new instructions that employees should “pause activities” on the request until noon Monday.\n“If I could say one thing to Elon Musk, it’s like, please put a dose of compassion in this,” Curtis, whose state has 33,000 federal employees, said on CBS’ “Face the Nation.” “These are real people.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email.", "WASHINGTON (AP) — President Donald Trump voiced support for Elon Musk’s demand that federal employees explain their recent accomplishments by the end of Monday or risk getting fired, an edict that has spawned new litigation and added to turmoil within the government workforce.\n“What he’s doing is saying, ‘Are you actually working?’” Trump said in the Oval Office during a meeting with French President Emmanuel Macron.\nThe guidance led to a proliferation of varying advice for federal employees, depending on where they work.\nThey’ve urged employees to resign, directed agencies to lay off probationary workers and halted work at some agencies altogether.\n“The email is legitimate and employees should respond,” wrote Rachel Oglesby, chief of staff at the department.", "Share Updated at 18.04 EST28m ago 17.40 EST Trump reinstated a rule requiring cost transparency in healthcare.\n“This move does not give the power back to the people – it gives power to the White House,” Heinrich posted on X.\nThe White House announcement this morning did not say what topics will be covered or how many will be signed.\nShare Updated at 16.22 EST3h ago 15.28 EST Judge gives Trump administration Wednesday night deadline to pay foreign aid funds This report is from Reuters.\nA federal judge in Seattle has blocked Donald Trump’s effort to halt the nation’s refugee admissions system.", "White House says Elon Musk will attend the first cabinet meetingYour support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.\nAnd unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls.\nRead moreDonald Trump’s administration remains mired in chaos after Elon Musk issued a new ultimatum on Monday night.\nHe gave federal workers one more chance to reply to his email threatening their jobs after multiple agency heads told their staff to ignore him.\nMusk apparently left himself a path to back off from his latest ultimatum by saying it was “subject to the discretion of the President,” adding to the chaos and confusion for workers.", "And by Sunday evening, agency leadership issued new instructions that employees should “pause activities” related to the request until noon on Monday.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email.\nPentagon leadership instructed employees to “pause” any response to Musk’s team, according to an email from Jules Hurst, the deputy undersecretary of defense for personnel and readiness.\nThe Homeland Security Department, meanwhile, told employees that “no reporting action from you is needed at this time” and that agency managers would respond, according to an email from R.D.", "Elon Musk deepened the confusion and alarm of workers across the federal government Saturday by ordering them to summarize their accomplishments for the week, warning that a failure to do so would be taken as a resignation.\nShortly after Mr. Musk’s demand, which he posted on X, civil servants across the government received an email from the Office of Personnel Management with the subject line, “What did you do last week?”The missive simultaneously hit inboxes across multiple agencies, rattling workers who had been rocked by layoffs in recent weeks and were unsure about whether to respond to Mr. Musk’s demand.\nOfficials at some agencies, including the F.B.I.\nand the State Department, told their employees to pause responses to the email.\nMr. Musk’s mounting pressure on the federal work force came at the encouragement of President Trump, who has been trumpeting how the billionaire has upended the bureaucracy and on Saturday urged him to be even “more aggressive.”", "WASHINGTON (AP) — President Donald Trump voiced support for Elon Musk’s demand that federal employees explain their recent accomplishments by the end of Monday or risk getting fired, an edict that has spawned new litigation and added to turmoil within the government workforce.\n“What he’s doing is saying, ‘Are you actually working?’” Trump said in the Oval Office during a meeting with French President Emmanuel Macron.\n“If people don’t respond, it’s very possible that there is no such person, or they aren’t working,” Trump said.\nREAD MORE: Fired federal workers search for new jobs but struggle to replace their old onesThe lawsuit, spearheaded by the State Democracy Defenders Fund, called the threat of mass firings “one of the most massive employment frauds in the history of this country.”The White House criticized the litigation.\n“The email is legitimate and employees should respond,” wrote Rachel Oglesby, chief of staff at the department.", "President Donald Trump's chainsaw-wielding, cost-cutting partner Elon Musk threatened federal employees with termination on Saturday, if they did not respond to an email from the Office of Personnel Management highlighting their work last week.\nThe email asked workers to reply and provide \"approx.\n5 bullets of what you accomplished last week and cc your manager\" before Monday at 11:59 p.m.\nEverett Kelley, national president of the American Federation of Government Employees, the top union representing federal workers, has already said the organization would challenge any “unlawful terminations” that result from not responding.\nThe AFGE represents more than 800,000 federal workers.", "McFadden, discussing the composition of the “press pool” that is chosen by the White House Correspondents’ Association, questioned why the government was obligated to follow those choices.\n“It feels a little odd that the White House is somehow bound by the decisions this private organization is making,” the judge told AP attorneys.\n(AP Photo/Kevin Wolf) Share Share Copy Link copiedEmailFacebookXRedditLinkedInPinterestFlipboardPrint Read MoreHe also questioned AP’s noting of its longtime membership in the White House press pool.\nBut he noted that the correspondents’ group had been tasked by the White House to choose the members of its pool.\n“The White House has accepted the correspondents’ association to be the referee here, and has just discriminated against one organization.", "Is there any sort of precedent for the power Trump is delegating to Musk?\nI don't think that comparison is entirely accurate, but it does illustrate the degree to which Trump has given Musk a pretty unprecedented level of access and power.\nI would guess that it matters to the extent that Trump thinks Musk is helping or hurting him.\njulia_azari: I've been in the camp of predicting a pretty significant clash between Musk and Trump in the future.\nI think public pushback, both broadly and in concentrated efforts, does affect these things, at least at the margin."]}, "Trump loyalist Kash Patel is confirmed as FBI director by the Senate despite deep Democratic doubts_-8797873084235180225": {"timestamp": 1740525177.845247, "sentiment": {"pos": 0.11629999999999999, "neu": 0.7934, "neg": 0.09029999999999999}, "text": ["“I cannot imagine a worse choice,” Sen. Dick Durbin, D-Ill., told colleagues before the 51-49 vote by the GOP-controlled Senate.\nPatel wants to make the FBI accountable once again -– get back the reputation that the FBI has had historically for law enforcement,” Sen. Chuck Grassley, R-Iowa, chairman of the Senate Judiciary Committee, said this week before Patel was confirmed.\n“This is someone who lacks the character to do this job, someone who lacks the integrity to do this job.\nAt his Senate hearing in January, Patel said Democrats were taking some of his comments out of context or misunderstanding the broader point he was trying to make.\nPatel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defense secretary.", "Senate confirms Kash Patel, fierce critic of FBI, to head the bureautoggle caption Anna Moneymaker/Getty ImagesThe Republican-led Senate voted Thursday to confirm Kash Patel as the new FBI director despite questions about whether he has the qualifications and the temperament to lead the nation's most powerful law enforcement agency.\nPatel, a close ally of President Trump and a fierce critic of the FBI, was confirmed by a 51-49 vote, with Republican Sens.\nConcerns about Patel's ability to lead the FBI were reflected in the narrow margin of his confirmation vote.\nDemocrats warn of \"red flags\"On Thursday morning, Democrats on the Senate Judiciary Committee gathered in front of FBI headquarters to speak out against Patel.\nSponsor MessageAfter Trump's election win last November, he tapped Patel to lead the FBI, effectively pushing Wray out of the job.", "ToplineThe Senate confirmed Kash Patel as FBI director Thursday, despite Sens.\nFBI Director Christopher Wray announced his intention to resign, clearing the way for Trump to install Patel as the next FBI chief.\nTrump announced he’s nominating Patel to be the next FBI director, following reports that Patel was being floated for the position.\nWho Is Kash Patel?\nKey BackgroundTrump named Patel as his FBI nominee in November, even before current FBI Director Christopher Wray announced in December he intended to resign.", "Mr. Schiff described Mr. Patel as a “political hack” and a “sycophant” who is unqualified for the position.\nHe went on to add that Mr. Patel is absolutely unqualified for the job and the Republicians are also aware about the same.\n“Adam Schiff is the worst criminal in Congress in the last 250 years,” he said.\nBillionaire Elon Musk echoed this, saying, “Adam Schiff is a criminal.”Who is Adam Schiff?\nMr. Schiff subsequently relocated to Los Angeles to take on the role of law clerk for Judge William Matthew Byrne, Jr.", "Goshen, IN (46526)TodayPartly cloudy early followed by cloudy skies overnight.\nSlight chance of a rain shower.\nWinds ESE at 5 to 10 mph..TonightPartly cloudy early followed by cloudy skies overnight.\nSlight chance of a rain shower.\nWinds ESE at 5 to 10 mph.", "NEW YORK: Newly-confirmed FBI Director Kash Patel got a Bollywood-style welcome from an aide of US President Donald Trump, who shared a morphed video of him dancing to the song -- Malhari -- from the film 'Bajirao Mastani'.\nPatel, 44, was confirmed on Thursday by a narrow vote in the Republican-led Senate, 51 to 49, and becomes the first Indian-American to lead the country's premier law enforcement agency.\nFollowing his confirmation, former White House Deputy Chief of Staff Dan Scavino posted on X an edited video of the song Malhari from the Ranveer Singh-starrer movie.\nIn the video, Patel's face is superimposed on Singh's, who is seen performing a victory dance.", "This website uses cookies to collect information about your visit for purposes such as showing you personalized ads and content, and analyzing our website traffic.\nBy clicking “Accept all,” you will allow the use of these cookies.\nAccept allReject all", "Kash Patel, President Trump’s choice to be director of the FBI, appears before the Senate Judiciary Committee for his confirmation hearing on Thursday.\nThe Senate Judiciary Committee voted along party lines Thursday to advance the nomination of Kash Patel, President Trump’s pick for FBI director, pushing past Democratic concerns that he would operate as a loyalist for the president and target perceived adversaries of the White House.\nThe committee voted 12 to 10 to send the nomination to the Republican-controlled Senate for full consideration.\nSen. Ashley Moody (R-Fla.) said Patel “might not have served in the upper echelons of the FBI, but aren’t we asking this agency to set a new course?\nPatel later joined Trump’s administration, as a counterterrorism official at the National Security Council and as chief of staff to the Defense Department.", "The US senate has narrowly voted to confirm Kash Patel as director of the FBI.\nHe resigned before Mr Trump took office.\nMr Trump has said that he expects some of those agents will be fired.\nHe attracted Mr Trump’s attention during the president’s first term when, as a staffer on the Republican-led House Intelligence Committee, Mr Patel helped write a memo with pointed criticism of the FBI’s investigation into ties between Russia and Mr Trump’s 2016 campaign.\nMr Patel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defence secretary.", "Kash Patel, President Trump’s choice to be FBI director, appears before the Senate Judiciary Committee for his confirmation hearing on Thursday.\nKash Patel, President Trump’s pick to lead the FBI, insisted to deeply skeptical Democrats on Thursday that he did not have an “enemies list” and that the bureau under his leadership would not seek retribution against the president’s adversaries or launch investigations for political purposes.\n“There will be no politicization at the FBI,” Patel said at a contentious Senate Judiciary Committee confirmation hearing.\nTrump picked Patel in November to replace Christopher A. Wray, who led the agency for more than seven years.\nSeveral Democratic senators on the Judiciary Committee who have met with Patel, including Durbin, have issued statements sounding the alarm and signaling their opposition to the pick."]}}