{"Trump loyalist Kash Patel is confirmed as FBI director by the Senate despite deep Democratic doubts_10": {"timestamp": 1740545905.193198, "data": [{"Summary": "“I cannot imagine a worse choice,” Sen. Dick Durbin, D-Ill., told colleagues before the 51-49 vote by the GOP-controlled Senate.\nPatel wants to make the FBI accountable once again -– get back the reputation that the FBI has had historically for law enforcement,” Sen. Chuck Grassley, R-Iowa, chairman of the Senate Judiciary Committee, said this week before Patel was confirmed.\n“This is someone who lacks the character to do this job, someone who lacks the integrity to do this job.\nAt his Senate hearing in January, Patel said Democrats were taking some of his comments out of context or misunderstanding the broader point he was trying to make.\nPatel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defense secretary."}, {"Summary": "Senate confirms Kash Patel, fierce critic of FBI, to head the bureautoggle caption Anna Moneymaker/Getty ImagesThe Republican-led Senate voted Thursday to confirm Kash Patel as the new FBI director despite questions about whether he has the qualifications and the temperament to lead the nation's most powerful law enforcement agency.\nPatel, a close ally of President Trump and a fierce critic of the FBI, was confirmed by a 51-49 vote, with Republican Sens.\nConcerns about Patel's ability to lead the FBI were reflected in the narrow margin of his confirmation vote.\nDemocrats warn of \"red flags\"On Thursday morning, Democrats on the Senate Judiciary Committee gathered in front of FBI headquarters to speak out against Patel.\nSponsor MessageAfter Trump's election win last November, he tapped Patel to lead the FBI, effectively pushing Wray out of the job."}, {"Summary": "ToplineThe Senate confirmed Kash Patel as FBI director Thursday, despite Sens.\nFBI Director Christopher Wray announced his intention to resign, clearing the way for Trump to install Patel as the next FBI chief.\nTrump announced he’s nominating Patel to be the next FBI director, following reports that Patel was being floated for the position.\nWho Is Kash Patel?\nKey BackgroundTrump named Patel as his FBI nominee in November, even before current FBI Director Christopher Wray announced in December he intended to resign."}, {"Summary": "Mr. Schiff described Mr. Patel as a “political hack” and a “sycophant” who is unqualified for the position.\nHe went on to add that Mr. Patel is absolutely unqualified for the job and the Republicians are also aware about the same.\n“Adam Schiff is the worst criminal in Congress in the last 250 years,” he said.\nBillionaire Elon Musk echoed this, saying, “Adam Schiff is a criminal.”Who is Adam Schiff?\nMr. Schiff subsequently relocated to Los Angeles to take on the role of law clerk for Judge William Matthew Byrne, Jr."}, {"Summary": "Following his confirmation, Patel expressed gratitude to Trump and Attorney General Pam Bondi for their support.\nThe Senate confirmed Indian-origin Kash Patel as the Director of the Federal Bureau of Investigation (FBI) on Thursday.\nPatel, a close ally of President Donald Trump, vowed to restore public trust in the agency by making it \"transparent, accountable, and committed to justice.\"\nFollowing his confirmation, Patel expressed gratitude to Trump and Attorney General Pam Bondi for their support.\nAs Patel assumes leadership, all eyes are on how he will navigate the political and operational challenges facing the FBI."}, {"Summary": "NEW YORK: Newly-confirmed FBI Director Kash Patel got a Bollywood-style welcome from an aide of US President Donald Trump, who shared a morphed video of him dancing to the song -- Malhari -- from the film 'Bajirao Mastani'.\nPatel, 44, was confirmed on Thursday by a narrow vote in the Republican-led Senate, 51 to 49, and becomes the first Indian-American to lead the country's premier law enforcement agency.\nFollowing his confirmation, former White House Deputy Chief of Staff Dan Scavino posted on X an edited video of the song Malhari from the Ranveer Singh-starrer movie.\nIn the video, Patel's face is superimposed on Singh's, who is seen performing a victory dance."}, {"Summary": "This website uses cookies to collect information about your visit for purposes such as showing you personalized ads and content, and analyzing our website traffic.\nBy clicking “Accept all,” you will allow the use of these cookies.\nAccept allReject all"}, {"Summary": "Table of Contents Ask the ChatbotDick Durbin (born November 21, 1944, East St. Louis, Illinois, U.S.) is an American politician who represented Illinois in the U.S. House of Representatives (1983–97) and in the U.S. Senate (1997– ), where he served as the Democratic majority whip (2005–15) and minority whip (2015– ).\nHe began his legal career in Springfield, Illinois, where he opened a law practice and also worked as legal counsel to the state’s lieutenant governor, Paul Simon (1969–72), and to the Illinois State Senate Judiciary Committee (1972–82).\nAs a senator, Durbin continued his advocacy for farmers; in 2000 he secured funding for an ethanol research pilot plant to be built near Edwardsville, Illinois.\nAs a member of the Judiciary Committee, Durbin chaired the human rights subcommittee that he helped establish in 2007.\n(more) See all videos for this articleDurbin was a strong supporter of the successful presidential campaign in 2008 of fellow senator from Illinois Barack Obama."}, {"Summary": "Kash Patel, President Trump’s choice to be director of the FBI, appears before the Senate Judiciary Committee for his confirmation hearing on Thursday.\nThe Senate Judiciary Committee voted along party lines Thursday to advance the nomination of Kash Patel, President Trump’s pick for FBI director, pushing past Democratic concerns that he would operate as a loyalist for the president and target perceived adversaries of the White House.\nThe committee voted 12 to 10 to send the nomination to the Republican-controlled Senate for full consideration.\nSen. Ashley Moody (R-Fla.) said Patel “might not have served in the upper echelons of the FBI, but aren’t we asking this agency to set a new course?\nPatel later joined Trump’s administration, as a counterterrorism official at the National Security Council and as chief of staff to the Defense Department."}, {"Summary": "The US senate has narrowly voted to confirm Kash Patel as director of the FBI.\nHe resigned before Mr Trump took office.\nMr Trump has said that he expects some of those agents will be fired.\nHe attracted Mr Trump’s attention during the president’s first term when, as a staffer on the Republican-led House Intelligence Committee, Mr Patel helped write a memo with pointed criticism of the FBI’s investigation into ties between Russia and Mr Trump’s 2016 campaign.\nMr Patel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defence secretary."}]}, "The latest on Trump’s presidency as Musk threatens more cuts to federal_10": {"timestamp": 1740525023.0967329, "data": [{"Summary": "WASHINGTON (AP) — Key U.S. agencies, including the FBI, State Department and the Pentagon, have instructed their employees not to comply with cost-cutting chief Elon Musk’s latest demand that federal workers explain what they accomplished last week — or risk losing their job.\nAnd by Sunday evening, agency leadership issued new instructions that employees should “pause activities” on the request until noon Monday.\n“If I could say one thing to Elon Musk, it’s like, please put a dose of compassion in this,” Curtis, whose state has 33,000 federal employees, said on CBS’ “Face the Nation.” “These are real people.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email."}, {"Summary": "WASHINGTON (AP) — President Donald Trump voiced support for Elon Musk’s demand that federal employees explain their recent accomplishments by the end of Monday or risk getting fired, an edict that has spawned new litigation and added to turmoil within the government workforce.\n“What he’s doing is saying, ‘Are you actually working?’” Trump said in the Oval Office during a meeting with French President Emmanuel Macron.\nThe guidance led to a proliferation of varying advice for federal employees, depending on where they work.\nThey’ve urged employees to resign, directed agencies to lay off probationary workers and halted work at some agencies altogether.\n“The email is legitimate and employees should respond,” wrote Rachel Oglesby, chief of staff at the department."}, {"Summary": "Share Updated at 18.04 EST28m ago 17.40 EST Trump reinstated a rule requiring cost transparency in healthcare.\n“This move does not give the power back to the people – it gives power to the White House,” Heinrich posted on X.\nThe White House announcement this morning did not say what topics will be covered or how many will be signed.\nShare Updated at 16.22 EST3h ago 15.28 EST Judge gives Trump administration Wednesday night deadline to pay foreign aid funds This report is from Reuters.\nA federal judge in Seattle has blocked Donald Trump’s effort to halt the nation’s refugee admissions system."}, {"Summary": "White House says Elon Musk will attend the first cabinet meetingYour support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.\nAnd unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls.\nRead moreDonald Trump’s administration remains mired in chaos after Elon Musk issued a new ultimatum on Monday night.\nHe gave federal workers one more chance to reply to his email threatening their jobs after multiple agency heads told their staff to ignore him.\nMusk apparently left himself a path to back off from his latest ultimatum by saying it was “subject to the discretion of the President,” adding to the chaos and confusion for workers."}, {"Summary": "And by Sunday evening, agency leadership issued new instructions that employees should “pause activities” related to the request until noon on Monday.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email.\nPentagon leadership instructed employees to “pause” any response to Musk’s team, according to an email from Jules Hurst, the deputy undersecretary of defense for personnel and readiness.\nThe Homeland Security Department, meanwhile, told employees that “no reporting action from you is needed at this time” and that agency managers would respond, according to an email from R.D."}, {"Summary": "Elon Musk deepened the confusion and alarm of workers across the federal government Saturday by ordering them to summarize their accomplishments for the week, warning that a failure to do so would be taken as a resignation.\nShortly after Mr. Musk’s demand, which he posted on X, civil servants across the government received an email from the Office of Personnel Management with the subject line, “What did you do last week?”The missive simultaneously hit inboxes across multiple agencies, rattling workers who had been rocked by layoffs in recent weeks and were unsure about whether to respond to Mr. Musk’s demand.\nOfficials at some agencies, including the F.B.I.\nand the State Department, told their employees to pause responses to the email.\nMr. Musk’s mounting pressure on the federal work force came at the encouragement of President Trump, who has been trumpeting how the billionaire has upended the bureaucracy and on Saturday urged him to be even “more aggressive.”"}, {"Summary": "WASHINGTON (AP) — President Donald Trump voiced support for Elon Musk’s demand that federal employees explain their recent accomplishments by the end of Monday or risk getting fired, an edict that has spawned new litigation and added to turmoil within the government workforce.\n“What he’s doing is saying, ‘Are you actually working?’” Trump said in the Oval Office during a meeting with French President Emmanuel Macron.\n“If people don’t respond, it’s very possible that there is no such person, or they aren’t working,” Trump said.\nREAD MORE: Fired federal workers search for new jobs but struggle to replace their old onesThe lawsuit, spearheaded by the State Democracy Defenders Fund, called the threat of mass firings “one of the most massive employment frauds in the history of this country.”The White House criticized the litigation.\n“The email is legitimate and employees should respond,” wrote Rachel Oglesby, chief of staff at the department."}, {"Summary": "President Donald Trump's chainsaw-wielding, cost-cutting partner Elon Musk threatened federal employees with termination on Saturday, if they did not respond to an email from the Office of Personnel Management highlighting their work last week.\nThe email asked workers to reply and provide \"approx.\n5 bullets of what you accomplished last week and cc your manager\" before Monday at 11:59 p.m.\nEverett Kelley, national president of the American Federation of Government Employees, the top union representing federal workers, has already said the organization would challenge any “unlawful terminations” that result from not responding.\nThe AFGE represents more than 800,000 federal workers."}, {"Summary": "McFadden, discussing the composition of the “press pool” that is chosen by the White House Correspondents’ Association, questioned why the government was obligated to follow those choices.\n“It feels a little odd that the White House is somehow bound by the decisions this private organization is making,” the judge told AP attorneys.\n(AP Photo/Kevin Wolf) Share Share Copy Link copiedEmailFacebookXRedditLinkedInPinterestFlipboardPrint Read MoreHe also questioned AP’s noting of its longtime membership in the White House press pool.\nBut he noted that the correspondents’ group had been tasked by the White House to choose the members of its pool.\n“The White House has accepted the correspondents’ association to be the referee here, and has just discriminated against one organization."}, {"Summary": "Is there any sort of precedent for the power Trump is delegating to Musk?\nI don't think that comparison is entirely accurate, but it does illustrate the degree to which Trump has given Musk a pretty unprecedented level of access and power.\nI would guess that it matters to the extent that Trump thinks Musk is helping or hurting him.\njulia_azari: I've been in the camp of predicting a pretty significant clash between Musk and Trump in the future.\nI think public pushback, both broadly and in concentrated efforts, does affect these things, at least at the margin."}]}, "China and Canada immediately retaliate against Trump’s tariffs. Mexico is next_10": {"timestamp": 1741113770.693376, "data": [{"Summary": "The flags of Mexico, Canada and the United States are shown near the Ambassador Bridge, Monday, Feb. 3, 2025, in Detroit.\n(AP Photo/Paul Sancya, File) The flags of Mexico, Canada and the United States are shown near the Ambassador Bridge, Monday, Feb. 3, 2025, in Detroit.\n“Today the United States launched a trade war against Canada, their closest partner and ally, their closest friend.\n(Ethan Cairns/The Canadian Press via AP, file) Share Share Copy Link copiedEmailFacebookXRedditLinkedInPinterestFlipboardPrint Read MoreThe tariffs may be short-lived if the U.S. economy suffers.\nJust last week, he said, Tecma helped a North Carolina manufacturer that moved to Mexico because it couldn’t find enough workers in the United States."}, {"Summary": "As Mr. Trump once again targeted Mexico, using the hammer of tariffs as a negotiating tool, a sense of Mexican nationalism has been strengthened.\nIn other words, analysts said, the U.S. tariffs against Mexico will hurt both economies, as would the reciprocal tariffs suggested by Ms. Sheinbaum.\n(Mr. Trump is also threatening separate 25 percent tariffs on global steel and aluminum imports, which would affect Mexico.)\nMr. Trump has nevertheless praised Ms. Sheinbaum as a “marvelous woman” while mocking Canada’s prime minister, Justin Trudeau.\nUnlike in Canada, where locals have been shunning American products and buying more Canadian flags since Mr. Trump threatened the tariffs, Mr. Sánchez said that Mexicans were already nationalistic and that most had a flag."}, {"Summary": "Canada announces reciprocal tariffs; Trudeau calls Trump's move \"a very dumb thing to do\"Canadian Prime Minister Justin Trudeau announced immediate retaliation to the new U.S. tariffs in a statement late Monday evening.\nThey will violate the very trade agreement that was negotiated by President Trump in his last term,\" Trudeau said.\n\"Today the United States launched a trade war against Canada, their closet partner and ally, their closet friend.\nMr. Trump has said repeatedly that Canada should become a U.S. \"51st state.\"\nShe said she was scheduled to have a call with Mr. Trump this week, probably on Thursday."}, {"Summary": "Trucks cross the Ambassador Bridge between Windsor, Canada and Detroit, Michigan on the first day of President Donald Trump's new 25% tariffs on goods from Canada and Mexico, Mar.\nTrucks cross the Ambassador Bridge between Windsor, Canada and Detroit, Michigan on the first day of President Donald Trump's new 25% tariffs on goods from Canada and Mexico, Mar.\nTrucks cross the Ambassador Bridge between Windsor, Canada and Detroit, Michigan on the first day of President Donald Trump's new 25% tariffs on goods from Canada and Mexico, Mar.\nAmerica's closest neighbors, Canada and Mexico, excoriated President Donald Trump for slapping historic tariffs on goods from their countries.\n\"President Trump continues to demonstrate his commitment to ensuring U.S. trade policy serves the national interest,\" the White House said in a statement."}, {"Summary": "Canada and China retaliate after Trump's tariffs take effecttoggle caption Andrew Harnik/Getty ImagesChina and Canada announced retaliatory measures on Tuesday after U.S. tariffs took effect overnight, escalating trade tensions and rattling global markets.\nPresident Trump's new tariffs include a 25% levy on most imports from Canada and Mexico, with an additional 10% tariff on Canadian energy exports.\nTariffs on an additional $86 billion worth of products will take effect in 21 days.\nTrump defended the tariffs, arguing that they would punish Canada and Mexico — the two largest trade partners to the U.S. — for fentanyl trafficking.\nMarkets drop amid fears of a trade warAsian markets tumbled shortly after the tariffs took effect."}, {"Summary": "'We'll fight to the bitter end': China and Canada retaliate against new Trump tariffsShow Caption Hide Caption Claudia Sheinbaum says Mexico will retaliate with US tariffs Claudia Sheinbaum said Mexico is prepared to impose tariffs on the United States after President Trump announced 25% tariffs on Mexican imports.\nPresident Donald Trump's new 25% tariffs on imports from Mexico and Canada were imposed at 12:01 a.m.\nTrump's tariffs: What does it mean to be made in America?\nEven before Trump's tariffs announcement, U.S. data on Monday showed factory gate prices jumped to a nearly three-year high, indicating the new wave of tariffs could soon undercut production.\n“Because of the tariffs imposed by the U.S., Americans will pay more for groceries, gas and cars, and potentially lose thousands of jobs,\" he said."}, {"Summary": "Why is Trump using tariffs?\nChina retaliates against US tariffs - but it also wants to talkWhat is happening with tariffs against Canada?\nCanada hits US with retaliatory tariffs after warning of 'existential threat'What is happening with tariffs against Mexico?\nTrump previously announced tariffs of 25% on steel and 15% on aluminium in 2018, during his first term as president.\nIn addition to steel, Canadian goods such as timber, grains and potatoes are also likely to get more expensive."}, {"Summary": "China and Canada have announced retaliatory measures against the US after Donald Trump imposed his sweeping tariffs plan, despite warnings it could spark an escalating trade war.\nUS tariffs of 25% have come into force against goods from Canada and Mexico, the US’s two biggest trading partners, and 20% tariffs against Chinese goods – doubling the levy on China from last month.\nChina said on Tuesday it would impose fresh tariffs on a range of agricultural imports from the US next week.\nTariffs will be placed on another C$125bn (£68bn) of US goods if Trump’s tariffs are still in place in 21 days.\nWhile he slapped a 10% tariff on China last month, Trump has repeatedly delayed the imposition of tariffs on Canada and Mexico."}, {"Summary": "President Trump will get another opportunity to explain his tariff plans on Tuesday night during a joint address to the U.S. Congress.\nA senior administration official told NBC News last week that tariffs would be one area of focus for Trump's remarks, along with immigration, government efficiency efforts and the rollback of diversity programs.\nTesla CEO and Trump adviser Elon Musk will attend the speech, a White House official told NBC News.\nThe event was planned before this week's trade war escalation.\nThe Democratic response to Trump's speech with come from Sen. Elissa Slotkin of Michigan."}, {"Summary": "“Today the United States launched a trade war against Canada, their closet partner and ally, their closet friend.\nThe Canada and Mexico tariffs were supposed to begin in February, but Trump agreed to a 30-day suspension to negotiate further with the two largest U.S. trading partners.\nSen. Susan Collins, R-Maine, said she’s “very concerned” about the tariffs going into effect because of her state’s proximity to Canada.\nThe world economy is now caught in the fog of what appears to be a trade war.\nThe White House would like to see a drop in seizures of fentanyl inside the United States, not just on the northern and southern borders."}]}}