[{"Summary": "The flags of Mexico, Canada and the United States are shown near the Ambassador Bridge, Monday, Feb. 3, 2025, in Detroit.\n(AP Photo/Paul Sancya, File) The flags of Mexico, Canada and the United States are shown near the Ambassador Bridge, Monday, Feb. 3, 2025, in Detroit.\n“Today the United States launched a trade war against Canada, their closest partner and ally, their closest friend.\n(Ethan Cairns/The Canadian Press via AP, file) Share Share Copy Link copiedEmailFacebookXRedditLinkedInPinterestFlipboardPrint Read MoreThe tariffs may be short-lived if the U.S. economy suffers.\nJust last week, he said, Tecma helped a North Carolina manufacturer that moved to Mexico because it couldn’t find enough workers in the United States."}, {"Summary": "As Mr. Trump once again targeted Mexico, using the hammer of tariffs as a negotiating tool, a sense of Mexican nationalism has been strengthened.\nIn other words, analysts said, the U.S. tariffs against Mexico will hurt both economies, as would the reciprocal tariffs suggested by Ms. Sheinbaum.\n(Mr. Trump is also threatening separate 25 percent tariffs on global steel and aluminum imports, which would affect Mexico.)\nMr. Trump has nevertheless praised Ms. Sheinbaum as a “marvelous woman” while mocking Canada’s prime minister, Justin Trudeau.\nUnlike in Canada, where locals have been shunning American products and buying more Canadian flags since Mr. Trump threatened the tariffs, Mr. Sánchez said that Mexicans were already nationalistic and that most had a flag."}, {"Summary": "Canada announces reciprocal tariffs; Trudeau calls Trump's move \"a very dumb thing to do\"Canadian Prime Minister Justin Trudeau announced immediate retaliation to the new U.S. tariffs in a statement late Monday evening.\nThey will violate the very trade agreement that was negotiated by President Trump in his last term,\" Trudeau said.\n\"Today the United States launched a trade war against Canada, their closet partner and ally, their closet friend.\nMr. Trump has said repeatedly that Canada should become a U.S. \"51st state.\"\nShe said she was scheduled to have a call with Mr. Trump this week, probably on Thursday."}, {"Summary": "Trucks cross the Ambassador Bridge between Windsor, Canada and Detroit, Michigan on the first day of President Donald Trump's new 25% tariffs on goods from Canada and Mexico, Mar.\nTrucks cross the Ambassador Bridge between Windsor, Canada and Detroit, Michigan on the first day of President Donald Trump's new 25% tariffs on goods from Canada and Mexico, Mar.\nTrucks cross the Ambassador Bridge between Windsor, Canada and Detroit, Michigan on the first day of President Donald Trump's new 25% tariffs on goods from Canada and Mexico, Mar.\nAmerica's closest neighbors, Canada and Mexico, excoriated President Donald Trump for slapping historic tariffs on goods from their countries.\n\"President Trump continues to demonstrate his commitment to ensuring U.S. trade policy serves the national interest,\" the White House said in a statement."}, {"Summary": "Canada and China retaliate after Trump's tariffs take effecttoggle caption Andrew Harnik/Getty ImagesChina and Canada announced retaliatory measures on Tuesday after U.S. tariffs took effect overnight, escalating trade tensions and rattling global markets.\nPresident Trump's new tariffs include a 25% levy on most imports from Canada and Mexico, with an additional 10% tariff on Canadian energy exports.\nTariffs on an additional $86 billion worth of products will take effect in 21 days.\nTrump defended the tariffs, arguing that they would punish Canada and Mexico — the two largest trade partners to the U.S. — for fentanyl trafficking.\nMarkets drop amid fears of a trade warAsian markets tumbled shortly after the tariffs took effect."}, {"Summary": "'We'll fight to the bitter end': China and Canada retaliate against new Trump tariffsShow Caption Hide Caption Claudia Sheinbaum says Mexico will retaliate with US tariffs Claudia Sheinbaum said Mexico is prepared to impose tariffs on the United States after President Trump announced 25% tariffs on Mexican imports.\nPresident Donald Trump's new 25% tariffs on imports from Mexico and Canada were imposed at 12:01 a.m.\nTrump's tariffs: What does it mean to be made in America?\nEven before Trump's tariffs announcement, U.S. data on Monday showed factory gate prices jumped to a nearly three-year high, indicating the new wave of tariffs could soon undercut production.\n“Because of the tariffs imposed by the U.S., Americans will pay more for groceries, gas and cars, and potentially lose thousands of jobs,\" he said."}, {"Summary": "Why is Trump using tariffs?\nChina retaliates against US tariffs - but it also wants to talkWhat is happening with tariffs against Canada?\nCanada hits US with retaliatory tariffs after warning of 'existential threat'What is happening with tariffs against Mexico?\nTrump previously announced tariffs of 25% on steel and 15% on aluminium in 2018, during his first term as president.\nIn addition to steel, Canadian goods such as timber, grains and potatoes are also likely to get more expensive."}, {"Summary": "China and Canada have announced retaliatory measures against the US after Donald Trump imposed his sweeping tariffs plan, despite warnings it could spark an escalating trade war.\nUS tariffs of 25% have come into force against goods from Canada and Mexico, the US’s two biggest trading partners, and 20% tariffs against Chinese goods – doubling the levy on China from last month.\nChina said on Tuesday it would impose fresh tariffs on a range of agricultural imports from the US next week.\nTariffs will be placed on another C$125bn (£68bn) of US goods if Trump’s tariffs are still in place in 21 days.\nWhile he slapped a 10% tariff on China last month, Trump has repeatedly delayed the imposition of tariffs on Canada and Mexico."}, {"Summary": "President Trump will get another opportunity to explain his tariff plans on Tuesday night during a joint address to the U.S. Congress.\nA senior administration official told NBC News last week that tariffs would be one area of focus for Trump's remarks, along with immigration, government efficiency efforts and the rollback of diversity programs.\nTesla CEO and Trump adviser Elon Musk will attend the speech, a White House official told NBC News.\nThe event was planned before this week's trade war escalation.\nThe Democratic response to Trump's speech with come from Sen. Elissa Slotkin of Michigan."}, {"Summary": "“Today the United States launched a trade war against Canada, their closet partner and ally, their closet friend.\nThe Canada and Mexico tariffs were supposed to begin in February, but Trump agreed to a 30-day suspension to negotiate further with the two largest U.S. trading partners.\nSen. Susan Collins, R-Maine, said she’s “very concerned” about the tariffs going into effect because of her state’s proximity to Canada.\nThe world economy is now caught in the fog of what appears to be a trade war.\nThe White House would like to see a drop in seizures of fentanyl inside the United States, not just on the northern and southern borders."}]