[{"Summary": "WASHINGTON (AP) — Key U.S. agencies, including the FBI, State Department and the Pentagon, have instructed their employees not to comply with cost-cutting chief Elon Musk’s latest demand that federal workers explain what they accomplished last week — or risk losing their job.\nAnd by Sunday evening, agency leadership issued new instructions that employees should “pause activities” on the request until noon Monday.\n“If I could say one thing to Elon Musk, it’s like, please put a dose of compassion in this,” Curtis, whose state has 33,000 federal employees, said on CBS’ “Face the Nation.” “These are real people.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email."}, {"Summary": "WASHINGTON (AP) — President Donald Trump voiced support for Elon Musk’s demand that federal employees explain their recent accomplishments by the end of Monday or risk getting fired, an edict that has spawned new litigation and added to turmoil within the government workforce.\n“What he’s doing is saying, ‘Are you actually working?’” Trump said in the Oval Office during a meeting with French President Emmanuel Macron.\nThe guidance led to a proliferation of varying advice for federal employees, depending on where they work.\nThey’ve urged employees to resign, directed agencies to lay off probationary workers and halted work at some agencies altogether.\n“The email is legitimate and employees should respond,” wrote Rachel Oglesby, chief of staff at the department."}, {"Summary": "I do five things in about ten minutes, and all federal workers should be working at the same pace that President Trump is working.\nThe White House announcement this morning did not say what topics will be covered or how many will be signed.\nShare Updated at 16.22 EST1h ago 15.28 EST Judge gives Trump administration Wednesday night deadline to pay foreign aid funds This report is from Reuters.\nRead more Share Updated at 15.53 EST1h ago 15.22 EST Judge extends block on Trump administration's freeze on federal funding This report is from Reuters.\nA federal judge in Seattle has blocked Donald Trump’s effort to halt the nation’s refugee admissions system."}, {"Summary": "White House says Elon Musk will attend the first cabinet meetingYour support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.\nAnd unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls.\nRead moreDonald Trump’s administration remains mired in chaos after Elon Musk issued a new ultimatum on Monday night.\nHe gave federal workers one more chance to reply to his email threatening their jobs after multiple agency heads told their staff to ignore him.\nMusk apparently left himself a path to back off from his latest ultimatum by saying it was “subject to the discretion of the President,” adding to the chaos and confusion for workers."}, {"Summary": "And by Sunday evening, agency leadership issued new instructions that employees should “pause activities” related to the request until noon on Monday.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email.\nPentagon leadership instructed employees to “pause” any response to Musk’s team, according to an email from Jules Hurst, the deputy undersecretary of defense for personnel and readiness.\nThe Homeland Security Department, meanwhile, told employees that “no reporting action from you is needed at this time” and that agency managers would respond, according to an email from R.D."}, {"Summary": "Elon Musk deepened the confusion and alarm of workers across the federal government Saturday by ordering them to summarize their accomplishments for the week, warning that a failure to do so would be taken as a resignation.\nShortly after Mr. Musk’s demand, which he posted on X, civil servants across the government received an email from the Office of Personnel Management with the subject line, “What did you do last week?”The missive simultaneously hit inboxes across multiple agencies, rattling workers who had been rocked by layoffs in recent weeks and were unsure about whether to respond to Mr. Musk’s demand.\nOfficials at some agencies, including the F.B.I.\nand the State Department, told their employees to pause responses to the email.\nMr. Musk’s mounting pressure on the federal work force came at the encouragement of President Trump, who has been trumpeting how the billionaire has upended the bureaucracy and on Saturday urged him to be even “more aggressive.”"}, {"Summary": "WASHINGTON (AP) — President Donald Trump voiced support for Elon Musk’s demand that federal employees explain their recent accomplishments by the end of Monday or risk getting fired, an edict that has spawned new litigation and added to turmoil within the government workforce.\n“What he’s doing is saying, ‘Are you actually working?’” Trump said in the Oval Office during a meeting with French President Emmanuel Macron.\n“If people don’t respond, it’s very possible that there is no such person, or they aren’t working,” Trump said.\nREAD MORE: Fired federal workers search for new jobs but struggle to replace their old onesThe lawsuit, spearheaded by the State Democracy Defenders Fund, called the threat of mass firings “one of the most massive employment frauds in the history of this country.”The White House criticized the litigation.\n“The email is legitimate and employees should respond,” wrote Rachel Oglesby, chief of staff at the department."}, {"Summary": "President Donald Trump's chainsaw-wielding, cost-cutting partner Elon Musk threatened federal employees with termination on Saturday, if they did not respond to an email from the Office of Personnel Management highlighting their work last week.\nThe email asked workers to reply and provide \"approx.\n5 bullets of what you accomplished last week and cc your manager\" before Monday at 11:59 p.m.\nEverett Kelley, national president of the American Federation of Government Employees, the top union representing federal workers, has already said the organization would challenge any “unlawful terminations” that result from not responding.\nThe AFGE represents more than 800,000 federal workers."}, {"Summary": "White House says Elon Musk will attend the first cabinet meetingYour support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.\nAnd unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls.\nRead moreDonald Trump’s administration remains mired in chaos after Elon Musk issued a new ultimatum on Monday night.\nHe gave federal workers one more chance to reply to his email threatening their jobs after multiple agency heads told their staff to ignore him.\nMusk apparently left himself a path to back off from his latest ultimatum by saying it was “subject to the discretion of the President,” adding to the chaos and confusion for workers."}, {"Summary": "McFadden, discussing the composition of the “press pool” that is chosen by the White House Correspondents’ Association, questioned why the government was obligated to follow those choices.\n“It feels a little odd that the White House is somehow bound by the decisions this private organization is making,” the judge told AP attorneys.\n(AP Photo/Kevin Wolf) Share Share Copy Link copiedEmailFacebookXRedditLinkedInPinterestFlipboardPrint Read MoreHe also questioned AP’s noting of its longtime membership in the White House press pool.\nBut he noted that the correspondents’ group had been tasked by the White House to choose the members of its pool.\n“The White House has accepted the correspondents’ association to be the referee here, and has just discriminated against one organization."}]