[{"Summary": "“I cannot imagine a worse choice,” Sen. Dick Durbin, D-Ill., told colleagues before the 51-49 vote by the GOP-controlled Senate.\nPatel wants to make the FBI accountable once again -– get back the reputation that the FBI has had historically for law enforcement,” Sen. Chuck Grassley, R-Iowa, chairman of the Senate Judiciary Committee, said this week before Patel was confirmed.\n“This is someone who lacks the character to do this job, someone who lacks the integrity to do this job.\nAt his Senate hearing in January, Patel said Democrats were taking some of his comments out of context or misunderstanding the broader point he was trying to make.\nPatel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defense secretary."}, {"Summary": "Senate confirms Kash Patel, fierce critic of FBI, to head the bureautoggle caption Anna Moneymaker/Getty ImagesThe Republican-led Senate voted Thursday to confirm Kash Patel as the new FBI director despite questions about whether he has the qualifications and the temperament to lead the nation's most powerful law enforcement agency.\nPatel, a close ally of President Trump and a fierce critic of the FBI, was confirmed by a 51-49 vote, with Republican Sens.\nConcerns about Patel's ability to lead the FBI were reflected in the narrow margin of his confirmation vote.\nDemocrats warn of \"red flags\"On Thursday morning, Democrats on the Senate Judiciary Committee gathered in front of FBI headquarters to speak out against Patel.\nSponsor MessageAfter Trump's election win last November, he tapped Patel to lead the FBI, effectively pushing Wray out of the job."}, {"Summary": "The person who discussed Patel’s vision did so on condition of anonymity to describe plans that have not been made public.\nAt his swearing-in ceremony, Patel called the opportunity to lead the nation’s premier federal law enforcement agency the “greatest honor” of his life.\nPatel has repeatedly spoken of his desire to implement major changes at the FBI.\n“Anyone that wishes to do harm to our way of life and our citizens, here and abroad, will face the full wrath of the DOJ and FBI,\" Patel said.\nCredit: AP Credit: APCredit: AP Credit: AP"}, {"Summary": "Mr. Schiff described Mr. Patel as a “political hack” and a “sycophant” who is unqualified for the position.\nHe went on to add that Mr. Patel is absolutely unqualified for the job and the Republicians are also aware about the same.\n“Adam Schiff is the worst criminal in Congress in the last 250 years,” he said.\nBillionaire Elon Musk echoed this, saying, “Adam Schiff is a criminal.”Who is Adam Schiff?\nMr. Schiff subsequently relocated to Los Angeles to take on the role of law clerk for Judge William Matthew Byrne, Jr."}, {"Summary": "Goshen, IN (46526)TodayPartly cloudy skies this evening will become overcast overnight.\nSlight chance of a rain shower.\nN winds shifting to SE at 10 to 20 mph..TonightPartly cloudy skies this evening will become overcast overnight.\nSlight chance of a rain shower.\nN winds shifting to SE at 10 to 20 mph."}, {"Summary": "NEW YORK: Newly-confirmed FBI Director Kash Patel got a Bollywood-style welcome from an aide of US President Donald Trump, who shared a morphed video of him dancing to the song -- Malhari -- from the film 'Bajirao Mastani'.\nPatel, 44, was confirmed on Thursday by a narrow vote in the Republican-led Senate, 51 to 49, and becomes the first Indian-American to lead the country's premier law enforcement agency.\nFollowing his confirmation, former White House Deputy Chief of Staff Dan Scavino posted on X an edited video of the song Malhari from the Ranveer Singh-starrer movie.\nIn the video, Patel's face is superimposed on Singh's, who is seen performing a victory dance."}, {"Summary": "This website uses cookies to collect information about your visit for purposes such as showing you personalized ads and content, and analyzing our website traffic.\nBy clicking “Accept all,” you will allow the use of these cookies.\nAccept allReject all"}, {"Summary": "The US senate has narrowly voted to confirm Kash Patel as director of the FBI.\nHe resigned before Mr Trump took office.\nMr Trump has said that he expects some of those agents will be fired.\nHe attracted Mr Trump’s attention during the president’s first term when, as a staffer on the Republican-led House Intelligence Committee, Mr Patel helped write a memo with pointed criticism of the FBI’s investigation into ties between Russia and Mr Trump’s 2016 campaign.\nMr Patel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defence secretary."}]