[{"Summary": "“Consistent with President @realDonaldTrump’s instructions, all federal employees will shortly receive an email requesting to understand what they got done last week,” Musk posted on X, which he owns.\n“Failure to respond will be taken as a resignation.”Shortly afterward, federal employees — including some judges, court staff and federal prison officials — received a three-line email with this instruction: “Please reply to this email with approx.\nSome agencies soon told employees that they did not have to comply if they received Musk’s message.\n“AFGE will challenge any unlawful terminations of our members and federal employees across the country.”Musk on Friday celebrated his new role at a gathering of conservatives by waving a giant chainsaw in the air.\nIn a message to employees on Saturday night, federal court officials instructed recipients not to respond."}, {"Summary": "By late last week, President Trump had decided to fire Gen. Charles Q.\nMr. Trump and General Caine met for an hour at the White House on Feb. 14.\nThe president’s deep skepticism prompted him to pass over the more obvious choices, like General Kurilla, to replace General Brown and to pluck General Caine from relative obscurity.\nHe was meeting regularly with Mr. Trump and other top national security aides to discuss military priorities in the Middle East.\nIn the end, General Kurilla seemed too similar to the officers whom Mr. Trump had soured on, aides said."}, {"Summary": "WASHINGTON (AP) — Key U.S. agencies, including the FBI, State Department and the Pentagon, have instructed their employees not to comply with cost-cutting chief Elon Musk’s latest demand that federal workers explain what they accomplished last week — or risk losing their job.\nAnd by Sunday evening, agency leadership issued new instructions that employees should “pause activities” on the request until noon Monday.\n“If I could say one thing to Elon Musk, it’s like, please put a dose of compassion in this,” Curtis, whose state has 33,000 federal employees, said on CBS’ “Face the Nation.” “These are real people.\nTibor Nagy, acting undersecretary of state for management, told employees in an email that department leadership would respond on behalf of workers.\n“No employee is obligated to report their activities outside of their Department chain of command,” Nagy wrote in an email."}, {"Summary": "President Donald Trump's chainsaw-wielding, cost-cutting partner Elon Musk threatened federal employees with termination on Saturday, if they did not respond to an email from the Office of Personnel Management highlighting their work last week.\nThe email asked workers to reply and provide \"approx.\n5 bullets of what you accomplished last week and cc your manager\" before Monday at 11:59 p.m.\nEverett Kelley, national president of the American Federation of Government Employees, the top union representing federal workers, has already said the organization would challenge any “unlawful terminations” that result from not responding.\nThe AFGE represents more than 800,000 federal workers."}, {"Summary": "They played a crucial role in helping Black workers like Verdine join the middle class and thrive.\nBut vast cuts by the Trump administration, led by Elon Musk’s Department of Government Efficiency, are threatening to close down that once-dependable path to financial stability.\n“The federal workforce was a means to help build Black middle class.\nSo, the idea that DEI was some pathway to giving Black people jobs, that just wasn’t true,” she said.\nSmith, from Local 252, said that although the federal jobs cuts are not labeled as DEI casualties, the pattern is curious."}, {"Summary": "Elon Musk, the billionaire head of the Trump administration's Department of Government Efficiency, threatened on Saturday to fire any federal worker who fails to explain what work they have accomplished during the previous week.\n\"All federal employees will shortly receive an email requesting to understand what they got done last week,\" Musk posted on X, formerly Twitter.\nWATCH | Protests on Capitol Hill target Musk cuts: DOGE claims to have saved $55B by slashing U.S. federal workforce Duration 2:50 The U.S. federal government purge led by Elon Musk and his Department of Government Efficiency (DOGE) has allegedly saved $55 billion largely through cutting jobs and contracts.\nSome government workers have resigned in protest over the restructuring moves and Musk’s access to sensitive data.\nIt is unclear what legal basis Musk has to terminate federal workers if they fail to respond to his request, which comes amid the Trump administration's fast-paced and controversial process to reduce government spending by shrinking the federal workforce."}, {"Summary": "Photograph: Justin Lane/EPADemocratic critics and legal experts see Trump’s IG firings and Musk’s Doge operation as blatant examples of executive power plays at the expense of Congress and transparency.\nIn response, Musk and Trump lashed out by charging judicial interference.\nView image in fullscreen Elon Musk stands behind Donald Trump at the Oval Office on Tuesday.\nThe lawsuit argues that Trump violated the constitution’s appointments clause by establishing a federal agency without Congress’s approval.\nAt bottom, some legal experts and watchdogs say the threats posed by Musk’s cost-cutting drive that Trump has blessed, are linked to the record sums that Musk gave Trump’s campaign."}, {"Summary": "Is there any sort of precedent for the power Trump is delegating to Musk?\nI don't think that comparison is entirely accurate, but it does illustrate the degree to which Trump has given Musk a pretty unprecedented level of access and power.\nI would guess that it matters to the extent that Trump thinks Musk is helping or hurting him.\njulia_azari: I've been in the camp of predicting a pretty significant clash between Musk and Trump in the future.\nI think public pushback, both broadly and in concentrated efforts, does affect these things, at least at the margin."}, {"Summary": "Elon Musk deepened the confusion and alarm of workers across the federal government Saturday by ordering them to summarize their accomplishments for the week, warning that a failure to do so would be taken as a resignation.\nShortly after Mr. Musk’s demand, which he posted on X, civil servants across the government received an email from the Office of Personnel Management with the subject line, “What did you do last week?”The missive simultaneously hit inboxes across multiple agencies, rattling workers who had been rocked by layoffs in recent weeks and were unsure about whether to respond to Mr. Musk’s demand.\nOfficials at some agencies, including the F.B.I.\nand the State Department, told their employees to pause responses to the email.\nMr. Musk’s mounting pressure on the federal work force came at the encouragement of President Trump, who has been trumpeting how the billionaire has upended the bureaucracy and on Saturday urged him to be even “more aggressive.”"}, {"Summary": "Trump threatens to cut funding for South Africa over land policyThere have been continuous calls for the government to address land reform and deal with the past injustices of racial segregation.\nHe added that the only funding South Africa received from the US was through the health initiative Pepfar, which represented \"17% of South Africa's HIV/Aids programme\".\nThe US allocated about $440m (£358m) in assistance to South Africa in 2023, according to US government data.\nThe ANC, led by Ramaphosa, currently governs South Africa as part of a coalition government with nine smaller parties.\nAt that time, South Africa accused Trump of seeking to sow division, with a spokesperson saying he was \"misinformed\"."}]